export const appointments = {
  pending: {
    status: "Очікування",
    message: [
      "Ваш запит на отримання електронного талону в даний момент розглядається співробітниками нашого центру обслуговування.",
      "Будь ласка, проявіть терпіння та зачекайте на підтвердження. Наші співробітники намагаються обробити ваш запит якнайшвидше для забезпечення найкращого обслуговування.",
    ],
  },
  confirmed: {
    status: "Підтверджено",
    message: [
      "Ваш електронний талон успішно підтверджено. Очікуйте на вказаний час та місце обслуговування.",
      "Пам'ятайте про важливість дотримання часу візиту в ЦНАП, а також не забудьте взяти всі необхідні документи.",
      "Будьте готові пред'явити свій талон для подтверждення при надходженні. Дякуємо за використання наших послуг, і ми з нетерпінням чекаємо на ваше відвідування!",
    ],
  },
  cancelled: {
    status: "Скасовано",
    message: [
      "На жаль, ваш електронний талон було скасовано.",
      "Ми радимо вам заново подати заявку на потрібну послугу. Дякуємо за розуміння!",
    ],
  },
  completed: {
    status: "Завершено",
    message: [
      "Ваше обслуговування за електронним талоном успішно завершено.",
      "Бажаємо вам гарного дня та нагадуємо, що завжди можете звертатися до нас із новими питаннями та потребами. Дякуємо за вибір наших послуг!",
    ],
  },
};

export default appointments;
